README.org
* Прошивка для платы Tang Primer 25k

Файлы в проекте
1. ~filter.sv~ -- сдвиговый регистр, используется для фильтрации
   дребезга входных сигналов.
2. ~top.sv~ -- основная логика работы контроллера (обработка команд ~I_C[2:0]~, ~I_CLK~)
3. ~testbench.sv~ -- простой тест, лучше бы его расширить различными сценариями работы
4. ~top.sdc~ -- констрейнты для клока
5. ~top.cst~ -- констрейнты для I/O
6. ~build_hw.sh~, ~run.tcl~ -- скрипты для сборки прошивки для ПЛИС (GOWIN IDE)
7. ~build_sim.sh~ -- скрипт для сборки проекта в ModelSim/QuestaSim

** Как собрать:
1. установить GOWIN IDE
2. поправить пути в ~build_hw.sh~ и запустить его либо напрямую
   запустить ~source run.tcl~ из IDE или ~gw_sh~
3. получившаяся прошивка располагается в
   ~impl/pnr/at24_scontrol.fs~. На ПЛИС заливать либо с помощью
   программатора GOWIN, либо с помощью ~openFPGALoader~:

#+BEGIN_SRC sh
openFPGALoader -b tangprimer25k impl/pnr/at24_scontrol.fs
#+END_SRC

** Как симулировать: Modelsim/Questasim

1. Убедиться, что Modelsim/Questasim находится в ~PATH~ (команды vlog, vlib, vmap, vsim)
2. Выполнить скрипт ~build_sim.sh~ -- он создаст ~Makefile~ для последующих перезапусков
3. Запустить GUI командой ~vsim -voptargs=+acc testbench~
4. В GUI добавить сигналы в БД командой ~log -r /*~
5. Добавить интересующие сигналы в waveform window
6. Запустить симуляцию командой ~run -all~

** Как симулировать: verilator/gtkwave

1. Собрать проект командой
#+BEGIN_SRC sh
verilator --binary -sv src/filter.sv src/top.sv src/testbench.sv --top-module testbench --trace --trace-structs
#+END_SRC
2. Запустить симуляцию: ~./obj_dir/Vtestbench~
3. Просмотреть получившийся файл ~waveform.vcd~ программой ~gtkwave~
